doc/log/0000_Getting-Started.org
#+TITLE: gx-quasar->GxQuasar: a simple idea to Gerbilize Javascript

I've been a *[back|middle|front]*-end web developer for pretty much my entire
career. For the last 16 years or so ([2020-10-30 Fri] is today) I've used Lisp.

Javascript was actually developed based on scheme and prototyped in Common
Lisp[fn:1]. I program in Gerbil Scheme[fn:2], a meta-dialect of Scheme with
post-modern features, whenever possible. The idea of using it for browser
development certainly piqued my interest.

This is an outline of the first attempt.

* Install Quasar

My main use of the browser is a GUI for my systems. My laptop and servers run
NixOS[fn:3]. We'll use the unstable ~<nixpkgs>~.

#+begin_src shell
nix-channel --add https://nixos.org/channels/nixpkgs-unstable
nix-channel --update
#+end_src

NodeJS 12 and yarn are the current choices.
#+begin_src shell
nix-env -iA nixpkgs.yarn nixpkgs.yarn2nix nixpkgs.nodejs-12_x
#+end_src

https://quasar.dev/quasar-cli/installation is a quick read but in essence:

#+begin_src shell
  yarn global add @quasar/cli
  # in ~/.bashrc or equivalent
  export PATH="$(yarn global bin):$PATH"

  LD=$CC yarn install
#+end_src

The ~LD=$CC~ is so the builder can find the libraries it wants. So create a
project.

#+begin_src shell
LD=$CC quasar create
#  [...]
#  [*] Quasar Project initialization finished!
#+end_src

We'll also use it for dev.

#+begin_src shell
LD=$CC quasar dev
#+end_src

* Hello World! Let's get easy.

Gerbil uses Gambit Scheme[fn:4] as its backend/compiler. Gambit recently got a
universal backend where it can compile to anything, and JavaScript AKA ~js~ is
one of its targets.

https://mailman.iro.umontreal.ca/pipermail/gambit-list/2020-March/009363.html is
a great overview.

Marc Feeley goes into some detail here:
https://gitter.im/gambit/gambit?at=5bc7fb95435c2a518ec448d1

One things I do want to avoid is having to load the entire Gambit system (30MB+)
every time I use it. It's very easy to do.

