log/0000_Getting-Started.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-25 Wed 11:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gx-quasar-&gt;GxQuasar: a simple idea to Gerbilize Javascript</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Drew Crampsie" />
</head>
<body>
<div id="content">
<h1 class="title">gx-quasar-&gt;GxQuasar: a simple idea to Gerbilize Javascript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeda801d">1. Install Quasar</a></li>
<li><a href="#orgaf5a986">2. Hello World! Let&rsquo;s get easy.</a>
<ul>
<li><a href="#org1cbe1e1">2.1. <code>hello-world-rt</code> and <code>hello-world.ss</code> : The hello world program</a></li>
</ul>
</li>
<li><a href="#orgd328205">3. <code>hello-gxjs-rt</code>: Things get a little harder.</a>
<ul>
<li><a href="#org4b5103b">3.1. <code>hello.ss</code> a Gerbil scheme file with our new runtime lib</a></li>
<li><a href="#org1893681">3.2. <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</a></li>
<li><a href="#orgc301f79">3.3. Now compilation to different <code>js</code> files!</a></li>
<li><a href="#orgfee710f">3.4. The new <code>Index.vue</code></a></li>
</ul>
</li>
<li><a href="#org3e71561">4. Full on <b>Gambit Scheme</b></a></li>
<li><a href="#org96e6c04">5. Lazy-load <code>_gambit.js</code>.</a>
<ul>
<li><a href="#org1eaa773">5.1. First attempt</a></li>
<li><a href="#org19d9fe3">5.2. Second Attempt: Make/change link files.</a></li>
<li><a href="#thirdreinit">5.3. Third Attempt: re-init registry</a></li>
<li><a href="#org4e2c8e2">5.4. A new <code>Index.vue</code></a></li>
</ul>
</li>
<li><a href="#orgf1585f7">6. Build and deploy the app</a></li>
</ul>
</div>
</div>
<p>
I&rsquo;ve been a <b>[back|middle|front]</b>-end web developer for pretty much my entire
career. For the last 16 years or so (<span class="timestamp-wrapper"><span class="timestamp">[2020-10-30 Fri] </span></span> is today) I&rsquo;ve used Lisp.
</p>

<p>
Javascript was actually developed based on scheme and prototyped in Common
Lisp<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. I program in Gerbil Scheme<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>, a meta-dialect of Scheme with
post-modern features, whenever possible. The idea of using it for browser
development certainly piqued my interest.
</p>

<p>
This is an outline of the first attempt.
</p>

<div id="outline-container-orgeda801d" class="outline-2">
<h2 id="orgeda801d"><span class="section-number-2">1</span> Install Quasar</h2>
<div class="outline-text-2" id="text-1">
<p>
My main use of the browser is a GUI for my systems. My laptop and servers run
NixOS<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>. We&rsquo;ll use the unstable <code>&lt;nixpkgs&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">nix-channel --add https://nixos.org/channels/nixpkgs-unstable
nix-channel --update
</pre>
</div>

<p>
NodeJS 12 and yarn are the current choices.
</p>
<div class="org-src-container">
<pre class="src src-shell">nix-env -iA nixpkgs.yarn nixpkgs.yarn2nix nixpkgs.nodejs-12_x
</pre>
</div>

<p>
<a href="https://quasar.dev/quasar-cli/installation">https://quasar.dev/quasar-cli/installation</a> is a quick read but in essence:
</p>

<div class="org-src-container">
<pre class="src src-shell">  yarn global add @quasar/cli
  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">in ~/.bashrc or equivalent</span>
  <span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PATH</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">yarn</span><span style="color: #51afef; font-weight: bold;"> global bin)</span><span style="color: #98be65;">:</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">PATH</span><span style="color: #98be65;">"</span>

  <span style="color: #dcaeea;">LD</span>=$<span style="color: #dcaeea;">CC</span> yarn install
</pre>
</div>

<p>
The <code>LD=$CC</code> is so the builder can find the libraries it wants. So create a
project.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">LD</span>=$<span style="color: #dcaeea;">CC</span> quasar create
<span style="color: #5B6268;">#  </span><span style="color: #5B6268;">[...]</span>
<span style="color: #5B6268;">#  </span><span style="color: #5B6268;">[*] Quasar Project initialization finished!</span>
</pre>
</div>

<p>
We&rsquo;ll also use it for dev.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">LD</span>=$<span style="color: #dcaeea;">CC</span> quasar dev
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf5a986" class="outline-2">
<h2 id="orgaf5a986"><span class="section-number-2">2</span> Hello World! Let&rsquo;s get easy.</h2>
<div class="outline-text-2" id="text-2">
<p>
Gerbil uses Gambit Scheme<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> as its backend/compiler. Gambit recently got a
universal backend where it can compile to anything, and JavaScript AKA <code>js</code> is
one of its targets.
</p>

<p>
<a href="https://mailman.iro.umontreal.ca/pipermail/gambit-list/2020-March/009363.html">https://mailman.iro.umontreal.ca/pipermail/gambit-list/2020-March/009363.html</a> is
a great overview.
</p>

<p>
Marc Feeley goes into some detail here:
<a href="https://gitter.im/gambit/gambit?at=5bc7fb95435c2a518ec448d1">https://gitter.im/gambit/gambit?at=5bc7fb95435c2a518ec448d1</a>
</p>

<p>
One things I do want to avoid is having to load the entire Gambit system (30MB+)
every time I use it. It&rsquo;s very easy to do.
</p>
</div>
