doc/log/0000_Getting-Started.org
** ~hello-world-rt~ and ~hello-world.ss~ : The hello world program

First our custom runtime library. We'll simply use gerbil and have nothing in
it.

By "nothing" I mean one function that runs at the very end of things and
initializes each gambit "module".

The ~(declare (extended-bindings))~ is for the ~##~ functions. Because we are
not using gambit for our runtime that's needed.

#+begin_src scheme :tangle ../../gx/hello-world-rt.ss
(declare (extended-bindings))

(def (run-each-module)
  (declare (extended-bindings) (not safe))
  (let ((mods (##vector-ref ##program-descr 0)))
    (let loop ((i 1)) ;; start at module after the current one
      (if (##fx< i (##vector-length mods))
            (let ((mod (##vector-ref mods i)))
              ((##vector-ref mod 4)) ;; call module's init procedure
              (loop (##fx+ i 1)))))))

(run-each-module) ;; run each module (after the current one)
#+end_src

Because we are using gerbil but want to use gambit as well, although ~gxc~ does
allow things to pass to ~gsc~, we'll simply do it manually.

Passing the ~-v -d . -S -static~ options tell ~gxc~ that we want things our way.

    - -v :: Be verbose
    - -d . :: Output to the current directory
    - -S . :: Don't invoke ~gsc~, we'll do it
    - -static :: output a gambit scheme file that is what ~gxc~ would have
       output.

#+begin_src shell
gxc -v -d . -S -static hello-world-rt.ss
# compile hello-world-rt.ss
# compile hello-world-rt
# compile ./hello-world-rt__0.scm
# copy static module ./hello-world-rt__0.scm => ./static/hello-world-rt.scm
# compile ./hello-world-rt__rt.scm
# compile ./hello-world-rt.ssi
rm hello-world-rt.ssi
#+end_src

Now time to play a gambit and output ~js~. We'll use ~gsc~ with the following.

   - -verbose :: Verbosity is always a good thing while learning/debugging.
   - -target js :: Aim for JavaScript!!
   - -c :: Compile to target language source files (.c, .js, ...)
   - -o :: Output to this file please


#+begin_src shell
gsc -verbose -target js -c -o hello-world-rt.js static/hello-world-rt.scm
#+end_src

That leaves us with a very small runtime! ~8k~.

#+begin_src shell
du hello-world-rt.js -h
# 8.0K    hello-world-rt.js
#+end_src

It doesn't actually do anything. A simple gerbil file that allows us to ~alert~
with a message from ~js~, AKA ~host~ will be our first attempt at *FFI*.

#+begin_src scheme :tangle ../../gx/hello-world.ss
(import :gerbil/gambit)
(declare (extended-bindings))

(def (alert str)
  (##inline-host-statement "alert('Hello!! ' + g_scm2host(@1@));" str))

(##inline-host-statement
 "exports.Hello = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn(arg)
}"
 (lambda (str) (alert str)))
#+end_src

That introduces functions.

  - ~##inline-host-statement~ :: A scheme function that takes a constant string
    and optionally arguments to place inside that statement that are marked with the ~@N@~ replacement string.
  - g_scm2host(...) :: A ~js~ function which takes a scheme primitive and turns
    it into a javascript primitive.

Let's make it into a ~js~ file! First the normal ~gxc~

#+begin_src shell
gxc -d . -S -static hello-world.ss
rm hello-world.ssi
#+end_src

And now for something different.

  - - l hello-world-rt :: Link to our runtime as the base library to use
  - -exe :: Output an executable file that contains everything needed.

#+begin_src shell
gsc -target js -l hello-world-rt -exe -o hello-world.js static/hello-world.scm
cp hello-world.js ../public/
 #+end_src

The generated JS does not pass ~eslint~, and we have that set up for quasar in
order to be dev friendly.


Let's get rid of eslint for that public directory. Look for this in
~quasar.conf.js~ and edit the exclude.

#+begin_src js
      // https://quasar.dev/quasar-cli/handling-webpack
      extendWebpack (cfg) {
        cfg.module.rules.push({
          enforce: 'pre',
          test: /\.(js|vue)$/,
          loader: 'eslint-loader',
          exclude: /(node_modules|public)/
        })
      }
#+end_src


Everything is now For The Web! So let's make a *Quasar* page that hellos our
world.

#+begin_src vue :tangle ../../src/pages/Index.vue
<template>
  <q-page class="flex flex-center">
    <q-btn color="red" @click="Hello('World!')"> Hello World</q-btn>
  </q-page>
</template>

<script>
import { Hello } from 'app/public/hello-world.js'
export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      Hello(arg)
    }
  }
}
</script>
#+end_src

It actually works! for ~20k~ I can have scheme in the browser. That means a lot!

#+begin_src shell
du -h hello-world.js
# 20.0K   hello-world.js
#+end_src

