log/0000_Getting-Started.html

<div id="outline-container-org1cbe1e1" class="outline-3">
<h3 id="org1cbe1e1"><span class="section-number-3">2.1</span> <code>hello-world-rt</code> and <code>hello-world.ss</code> : The hello world program</h3>
<div class="outline-text-3" id="text-2-1">
<p>
First our custom runtime library. We&rsquo;ll simply use gerbil and have nothing in
it.
</p>

<p>
By &ldquo;nothing&rdquo; I mean one function that runs at the very end of things and
initializes each gambit &ldquo;module&rdquo;.
</p>

<p>
The <code>(declare (extended-bindings))</code> is for the <code>##</code> functions. Because we are
not using gambit for our runtime that&rsquo;s needed.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">run-each-module</span>)
  (<span style="color: #51afef;">declare</span> (extended-bindings) (<span style="color: #51afef;">not</span> safe))
  (<span style="color: #51afef;">let</span> ((mods (<span style="color: #c678dd;">##</span>vector-ref <span style="color: #c678dd;">##</span>program-descr 0)))
    (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((i 1)) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">start at module after the current one</span>
      (<span style="color: #51afef;">if</span> (<span style="color: #c678dd;">##</span>fx&lt; i (<span style="color: #c678dd;">##</span>vector-length mods))
            (<span style="color: #51afef;">let</span> ((mod (<span style="color: #c678dd;">##</span>vector-ref mods i)))
              ((<span style="color: #c678dd;">##</span>vector-ref mod 4)) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">call module's init procedure</span>
              (loop (<span style="color: #c678dd;">##</span>fx+ i 1)))))))

(run-each-module) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">run each module (after the current one)</span>
</pre>
</div>

<p>
Because we are using gerbil but want to use gambit as well, although <code>gxc</code> does
allow things to pass to <code>gsc</code>, we&rsquo;ll simply do it manually.
</p>

<p>
Passing the <code>-v -d . -S -static</code> options tell <code>gxc</code> that we want things our way.
</p>

<dl class="org-dl">
<dt>-v</dt><dd>Be verbose</dd>
<dt>-d .</dt><dd>Output to the current directory</dd>
<dt>-S .</dt><dd>Don&rsquo;t invoke <code>gsc</code>, we&rsquo;ll do it</dd>
<dt>-static</dt><dd>output a gambit scheme file that is what <code>gxc</code> would have
output.</dd>
</dl>

<div class="org-src-container">
<pre class="src src-shell">gxc -v -d . -S -static hello-world-rt.ss
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">compile hello-world-rt.ss</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">compile hello-world-rt</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">compile ./hello-world-rt__0.scm</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">copy static module ./hello-world-rt__0.scm =&gt; ./static/hello-world-rt.scm</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">compile ./hello-world-rt__rt.scm</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">compile ./hello-world-rt.ssi</span>
<span style="color: #ECBE7B;">rm</span> hello-world-rt.ssi
</pre>
</div>

<p>
Now time to play a gambit and output <code>js</code>. We&rsquo;ll use <code>gsc</code> with the following.
</p>

<dl class="org-dl">
<dt>-verbose</dt><dd>Verbosity is always a good thing while learning/debugging.</dd>
<dt>-target js</dt><dd>Aim for JavaScript!!</dd>
<dt>-c</dt><dd>Compile to target language source files (.c, .js, &#x2026;)</dd>
<dt>-o</dt><dd>Output to this file please</dd>
</dl>


<div class="org-src-container">
<pre class="src src-shell">gsc -verbose -target js -c -o hello-world-rt.js static/hello-world-rt.scm
</pre>
</div>

<p>
That leaves us with a very small runtime! <code>8k</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">du hello-world-rt.js -h
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">8.0K    hello-world-rt.js</span>
</pre>
</div>

<p>
It doesn&rsquo;t actually do anything. A simple gerbil file that allows us to <code>alert</code>
with a message from <code>js</code>, AKA <code>host</code> will be our first attempt at <b>FFI</b>.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">import</span> <span style="color: #c678dd;">:gerbil/gambit</span>)
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">alert</span> str)
  (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"alert('Hello!! ' + g_scm2host(@1@));"</span> str))

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Hello = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn(arg)</span>
<span style="color: #98be65;">}"</span>
 (<span style="color: #51afef;">lambda</span> (str) (alert str)))
</pre>
</div>

<p>
That introduces functions.
</p>

<dl class="org-dl">
<dt><code>##inline-host-statement</code></dt><dd>A scheme function that takes a constant string
and optionally arguments to place inside that statement that are marked with the <code>@N@</code> replacement string.</dd>
<dt>g<sub>scm2host</sub>(&#x2026;)</dt><dd>A <code>js</code> function which takes a scheme primitive and turns
it into a javascript primitive.</dd>
</dl>

<p>
Let&rsquo;s make it into a <code>js</code> file! First the normal <code>gxc</code>
</p>

<div class="org-src-container">
<pre class="src src-shell">gxc -d . -S -static hello-world.ss
<span style="color: #ECBE7B;">rm</span> hello-world.ssi
</pre>
</div>

<p>
And now for something different.
</p>

<dl class="org-dl">
<dt>- l hello-world-rt</dt><dd>Link to our runtime as the base library to use</dd>
<dt>-exe</dt><dd>Output an executable file that contains everything needed.</dd>
</dl>

<div class="org-src-container">
<pre class="src src-shell">gsc -target js -l hello-world-rt -exe -o hello-world.js static/hello-world.scm
<span style="color: #ECBE7B;">cp</span> hello-world.js ../public/
</pre>
</div>

<p>
The generated JS does not pass <code>eslint</code>, and we have that set up for quasar in
order to be dev friendly.
</p>


<p>
Let&rsquo;s get rid of eslint for that public directory. Look for this in
<code>quasar.conf.js</code> and edit the exclude.
</p>

<div class="org-src-container">
<pre class="src src-js">      <span style="color: #5B6268;">// </span><span style="color: #5B6268;">https://quasar.dev/quasar-cli/handling-webpack</span>
      extendWebpack (cfg) {
        cfg.module.rules.push({
          enforce: <span style="color: #98be65;">'pre'</span>,
          test: <span style="color: #98be65;">/\.(js|vue)$/</span>,
          loader: <span style="color: #98be65;">'eslint-loader'</span>,
          exclude: <span style="color: #98be65;">/(node_modules|public)/</span>
        })
      }
</pre>
</div>


<p>
Everything is now For The Web! So let&rsquo;s make a <b>Quasar</b> page that hellos our
world.
</p>

<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
  &lt;<span style="color: #c678dd;">q-page</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"flex flex-center"</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Hello('World!')"</span>&gt; Hello World&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
  &lt;/<span style="color: #c678dd;">q-page</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;
import { Hello } from 'app/public/hello-world.js'
export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      Hello(arg)
    }
  }
}
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>

<p>
It actually works! for <code>20k</code> I can have scheme in the browser. That means a lot!
</p>

<div class="org-src-container">
<pre class="src src-shell">du -h hello-world.js
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">20.0K   hello-world.js</span>
</pre>
</div>
</div>
</div>
</div>
