doc/log/0000_Getting-Started.org
* ~hello-gxjs-rt~: Things get a little harder.

One thing I desire is the ability to load on demand as well as use both languages the way they are meant to be used. Anyone familiar with *FFI* knows this is never easy.

In this case the first thing that pops up is *modules*. ~js~ has them, ~gerbil~ has them, ~gambit~ has them, and they all differ.

Because we want to use ~gerbil~ and ~js~ with ~gambit~ being a distant cousin we
have to mess around.

#+begin_src scheme :tangle ~/me/ecm/src/gx-quasar/gx/hello-gxjs-rt.ss
namespace: gxjs
(declare (extended-bindings))

(def (alert thing) (##inline-host-statement "var foo = (@1@);
  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)
  alert(bar);" thing))
(def (console.log obj) (##inline-host-statement "console.log((@1@))" obj))

(def (gambit-module-name mod)
  (def obj (##vector-ref (##vector-ref mod 0) 0))
  (##inline-host-expression "(@1@).name" obj))

(def (init-gambit-module mod)
  (let ((init (##vector-ref mod 4)))
    (if (not (##procedure? init)) (error "No init for " mod)
      (init))))

(define (init-gambit-program)
  (declare (extended-bindings) (not safe))
    (let ((mods (##vector-ref ##program-descr 0)))
      (let loop ((i 1)) ;; start at module after the current one
        (if (##fx< i (##vector-length mods))
            (let ((mod (##vector-ref mods i)))
              (init-gambit-module mod) ;; call module's init procedure
              (loop (##fx+ i 1)))))))

(init-gambit-program)

(##inline-host-declaration "
gx_old_module_register = g_module_register;

gx_gambit_module_table = [];

gx_gambit_module_init = function (m) { alert('gx_gambit_module_init undefined') }

gx_gambit_module_register = function (module_descr) {
  gx_gambit_module_table.push(module_descr);
  typeof g_glo['##program-descr'] === 'object' ? gx_gambit_module_init(module_descr)
    : gx_old_module_register(module_descr)
}

g_module_register = gx_gambit_module_register;

console.log(g_module_register);

")

(##inline-host-statement "gx_gambit_module_init = (g_scm2host(@1@))" (lambda (mod) (init-gambit-module mod)))
#+end_src


** ~hello.ss~ a Gerbil scheme file with our new runtime lib

#+begin_src scheme :tangle ../../gx/hello.ss
(declare (extended-bindings))
(extern namespace: gxjs alert)

(##inline-host-statement
 "exports.Hello = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn('Hello ' + arg)
}"
 (lambda (str) (alert str)))
#+end_src

** ~gambit-module-test.ss~: A module not loaded in the gambit program

#+begin_src scheme :tangle ../../gx/gambit-module-test.ss
(declare (extended-bindings))
(extern namespace: gxjs alert console.log)

(##inline-host-statement
 "exports.Test = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn('Test' + arg)
}"
 (lambda (str)
   (let* ((mod (##inline-host-expression "gx_gambit_module_table[1];"))
          (name (gxjs#gambit-module-name mod)))
     (console.log mod)

     (alert str) (alert name))))
#+end_src

** Now compilation to different ~js~ files!

#+begin_src shell
gxc -v -d . -S -static hello-gxjs-rt.ss
gxc -v -d . -S -static hello.ss
gxc -v -d . -S -static gambit-module-test.ss

gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm
gsc -target js -o hello-gxjs.js -exe -l hello-gxjs-rt static/hello.scm

# Now output the modules test as a standalone
gsc -target js -o gambit-module-test.js static/gambit-module-test.scm

# and copy to public

cp hello-gxjs.js gambit-module-test.js ../public

#+end_src

** The new ~Index.vue~


#+begin_src vue :tangle ../../src/pages/hello-gxjs-Index.vue
<template>
  <q-page class="flex flex-center">
    <q-btn color="red" @click="Hello('World! Tangle!')"> Hello World</q-btn>
    <q-btn color="red" @click="Test('World! Tangle!')"> Test function</q-btn>
  </q-page>
</template>

<script>

import { Hello } from 'app/public/hello-gxjs.js'

import { Test } from 'app/public/gambit-module-test.js'

window.Hello = Hello
window.Test = Test

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    }
  }
}
</script>
#+end_src
And it works! Yay!

