log/0000_Getting-Started.html

<div id="outline-container-orgd328205" class="outline-2">
<h2 id="orgd328205"><span class="section-number-2">3</span> <code>hello-gxjs-rt</code>: Things get a little harder.</h2>
<div class="outline-text-2" id="text-3">
<p>
One thing I desire is the ability to load on demand as well as use both languages the way they are meant to be used. Anyone familiar with <b>FFI</b> knows this is never easy.
</p>

<p>
In this case the first thing that pops up is <b>modules</b>. <code>js</code> has them, <code>gerbil</code> has them, <code>gambit</code> has them, and they all differ.
</p>

<p>
Because we want to use <code>gerbil</code> and <code>js</code> with <code>gambit</code> being a distant cousin we
have to mess around.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> gxjs
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">alert</span> thing) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"var foo = (@1@);</span>
<span style="color: #98be65;">  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)</span>
<span style="color: #98be65;">  alert(bar);"</span> thing))
(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">console.log</span> obj) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"console.log((@1@))"</span> obj))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">gambit-module-name</span> mod)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">obj</span> (<span style="color: #c678dd;">##</span>vector-ref (<span style="color: #c678dd;">##</span>vector-ref mod 0) 0))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"(@1@).name"</span> obj))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">init-gambit-module</span> mod)
  (<span style="color: #51afef;">let</span> ((init (<span style="color: #c678dd;">##</span>vector-ref mod 4)))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (<span style="color: #c678dd;">##</span>procedure? init)) (<span style="color: #51afef;">error</span> <span style="color: #98be65;">"No init for "</span> mod)
      (init))))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">init-gambit-program</span>)
  (<span style="color: #51afef;">declare</span> (extended-bindings) (<span style="color: #51afef;">not</span> safe))
    (<span style="color: #51afef;">let</span> ((mods (<span style="color: #c678dd;">##</span>vector-ref <span style="color: #c678dd;">##</span>program-descr 0)))
      (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((i 1)) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">start at module after the current one</span>
        (<span style="color: #51afef;">if</span> (<span style="color: #c678dd;">##</span>fx&lt; i (<span style="color: #c678dd;">##</span>vector-length mods))
            (<span style="color: #51afef;">let</span> ((mod (<span style="color: #c678dd;">##</span>vector-ref mods i)))
              (init-gambit-module mod) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">call module's init procedure</span>
              (loop (<span style="color: #c678dd;">##</span>fx+ i 1)))))))

(init-gambit-program)

(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"</span>
<span style="color: #98be65;">gx_old_module_register = g_module_register;</span>

<span style="color: #98be65;">gx_gambit_module_table = [];</span>

<span style="color: #98be65;">gx_gambit_module_init = function (m) { alert('gx_gambit_module_init undefined') }</span>

<span style="color: #98be65;">gx_gambit_module_register = function (module_descr) {</span>
<span style="color: #98be65;">  gx_gambit_module_table.push(module_descr);</span>
<span style="color: #98be65;">  typeof g_glo['##program-descr'] === 'object' ? gx_gambit_module_init(module_descr)</span>
<span style="color: #98be65;">    : gx_old_module_register(module_descr)</span>
<span style="color: #98be65;">}</span>

<span style="color: #98be65;">g_module_register = gx_gambit_module_register;</span>

<span style="color: #98be65;">console.log(g_module_register);</span>

<span style="color: #98be65;">"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"gx_gambit_module_init = (g_scm2host(@1@))"</span> (<span style="color: #51afef;">lambda</span> (mod) (init-gambit-module mod)))
</pre>
</div>
</div>


<div id="outline-container-org4b5103b" class="outline-3">
<h3 id="org4b5103b"><span class="section-number-3">3.1</span> <code>hello.ss</code> a Gerbil scheme file with our new runtime lib</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">declare</span> (extended-bindings))
(<span style="color: #51afef;">extern</span> <span style="color: #c678dd;">namespace:</span> gxjs alert)

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Hello = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn('Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
 (<span style="color: #51afef;">lambda</span> (str) (alert str)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1893681" class="outline-3">
<h3 id="org1893681"><span class="section-number-3">3.2</span> <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">declare</span> (extended-bindings))
(<span style="color: #51afef;">extern</span> <span style="color: #c678dd;">namespace:</span> gxjs alert console.log)

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Test = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn('Test' + arg)</span>
<span style="color: #98be65;">}"</span>
 (<span style="color: #51afef;">lambda</span> (str)
   (<span style="color: #51afef;">let*</span> ((mod (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"gx_gambit_module_table[1];"</span>))
          (name (gxjs<span style="color: #c678dd;">#</span>gambit-module-name mod)))
     (console.log mod)

     (alert str) (alert name))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc301f79" class="outline-3">
<h3 id="orgc301f79"><span class="section-number-3">3.3</span> Now compilation to different <code>js</code> files!</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-shell">gxc -v -d . -S -static hello-gxjs-rt.ss
gxc -v -d . -S -static hello.ss
gxc -v -d . -S -static gambit-module-test.ss

gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm
gsc -target js -o hello-gxjs.js -exe -l hello-gxjs-rt static/hello.scm

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Now output the modules test as a standalone</span>
gsc -target js -o gambit-module-test.js static/gambit-module-test.scm

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">and copy to public</span>

<span style="color: #ECBE7B;">cp</span> hello-gxjs.js gambit-module-test.js ../public

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfee710f" class="outline-3">
<h3 id="orgfee710f"><span class="section-number-3">3.4</span> The new <code>Index.vue</code></h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
  &lt;<span style="color: #c678dd;">q-page</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"flex flex-center"</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Hello('World! Tangle!')"</span>&gt; Hello World&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Test('World! Tangle!')"</span>&gt; Test function&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
  &lt;/<span style="color: #c678dd;">q-page</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;

import { Hello } from 'app/public/hello-gxjs.js'

import { Test } from 'app/public/gambit-module-test.js'

window.Hello = Hello
window.Test = Test

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    }
  }
}
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>
<p>
And it works! Yay!
</p>
</div>
</div>
</div>
