doc/log/0000_Getting-Started.org
* Full on *Gambit Scheme*

https://udem-dlteam.github.io/webapp-tutorial/ and
https://github.com/udem-dlteam/webapp-tutorial are wonderful places to start. It
basically shows we can have a full gambit-in-browser.


Let's build our hello with a full gambit and see.

#+begin_src shell
bash <<EOF
gxc -v -d . -S -static gambit-hello-world.ss
gxc -v -d . -S -static gambit-hello-world-module-test.ss
gsc -target js -exe -o gambit-hello-world.js static/gambit-hello-world.scm
gsc -target js -o gambit-hello-world-module-test.js static/gambit-hello-world-module-test.scm
cp gambit-hello-world*.js ../public/
EOF
#+end_src

#+begin_src scheme :tangle ../../gx/gambit-hello-world.ss
(import :gerbil/gambit)
(declare (extended-bindings))

(##inline-host-statement
 "exports.Hello = (arg) => {
  alert('Hello ' + arg)
}"
)

(define (document.getElementById id)
  (##inline-host-expression "g_host2foreign(document.getElementById(g_scm2host(@1@)))" id))

(define (Element.innerText-ref elem)
  (##inline-host-expression "g_host2scm(g_foreign2host(@1@).innerText)" elem))

(define (sourceCodeRun id)
  (let* ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (let ((expr (cons '##begin (with-input-from-string code read-all))))
      (eval expr))

    ))

(def (init-gambit-module mod)
  (let ((init (##vector-ref mod 4)))
    (if (not (##procedure? init)) (error "No init for " mod)
      (init))))

(##inline-host-declaration "
gx_old_module_register = g_module_register;

gx_gambit_module_table = [];

gx_gambit_module_init = function (m) { alert('gx_gambit_module_init undefined') }

gx_gambit_module_register = function (module_descr) {
  gx_gambit_module_table.push(module_descr);
  typeof g_glo['##program-descr'] === 'object' ? gx_gambit_module_init(module_descr)
    : gx_old_module_register(module_descr)
}

g_module_register = gx_gambit_module_register;

console.log(g_module_register);

")

(##inline-host-statement "gx_gambit_module_init = (g_scm2host(@1@))" (lambda (mod) (init-gambit-module mod)))


(##inline-host-declaration "g_sourceCodeRun = function () { alert('sourceCodeRun'); };")

(##inline-host-statement "g_sourceCodeRun = g_scm2host(@1@);" sourceCodeRun)

#+end_src

#+begin_src scheme :tangle ../../gx/gambit-hello-world-module-test.ss
(declare (extended-bindings))
(##inline-host-statement
 "exports.Test = (arg) => {
  alert('Test' + arg)
}"
)
#+end_src

#+begin_src vue :tangle ../../src/pages/gambitHelloIndex.vue
<template>
  <q-page>
    <q-btn color="red" @click="Hello('WOrld! Tahgle!')"> Hello World</q-btn>
    <q-btn color="red" @click="Test('WOrld! Tahgle!')"> Test function</q-btn>
    <br>
    <div class="full-width" contenteditable="true" id="gx_repl" style="max-width: 300px; height: 25vh; border: 2px solid black;">
    534
   </div>
    <q-btn color="red" @click="sourceCodeRun('gx_repl')"> Repl </q-btn>
  </q-page>
</template>

<script>

import { Hello } from 'app/public/gambit-hello-world.js'

import { Test } from 'app/public/gambit-hello-world-module-test.js'

window.Hello = Hello
window.Test = Test

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    },
    sourceCodeRun (id) {
      var val = g_sourceCodeRun(id)
      alert('=>' + val)
    }
  }
}
</script>
#+end_src


* Lazy-load ~_gambit.js~.

That works as well. So, now, an attempt to make the Gambit ~_gambit~ module
become a dynamically loaded ~js~ module.


#+begin_src scheme :tangle ../../gx/lazy-gambit-repl.ss
(import :gerbil/gambit)
(declare (extended-bindings))

(##inline-host-statement
 "exports.evalElement = (arg) => {
  alert('Lazy? Hello ' + arg)
}"
)

(define (document.getElementById id)
  (##inline-host-expression "g_host2foreign(document.getElementById(g_scm2host(@1@)))" id))

(define (Element.innerText-ref elem)
  (##inline-host-expression "g_host2scm(g_foreign2host(@1@).innerText)" elem))

(define (sourceCodeRun id)
  (let* ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (let ((expr (cons '##begin (with-input-from-string code read-all))))
      (eval expr))

    ))

(##inline-host-declaration "g_sourceCodeRun = function () { alert('sourceCodeRun'); };")

(##inline-host-statement "g_sourceCodeRun = g_scm2host(@1@);" sourceCodeRun)

#+end_src

