log/0000_Getting-Started.html

<div id="outline-container-org3e71561" class="outline-2">
<h2 id="org3e71561"><span class="section-number-2">4</span> Full on <b>Gambit Scheme</b></h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://udem-dlteam.github.io/webapp-tutorial/">https://udem-dlteam.github.io/webapp-tutorial/</a> and
<a href="https://github.com/udem-dlteam/webapp-tutorial">https://github.com/udem-dlteam/webapp-tutorial</a> are wonderful places to start. It
basically shows we can have a full gambit-in-browser.
</p>


<p>
Let&rsquo;s build our hello with a full gambit and see.
</p>

<div class="org-src-container">
<pre class="src src-shell">bash &lt;&lt;EOF
<span style="color: #98be65;">gxc -v -d . -S -static gambit-hello-world.ss</span>
<span style="color: #98be65;">gxc -v -d . -S -static gambit-hello-world-module-test.ss</span>
<span style="color: #98be65;">gsc -target js -exe -o gambit-hello-world.js static/gambit-hello-world.scm</span>
<span style="color: #98be65;">gsc -target js -o gambit-hello-world-module-test.js static/gambit-hello-world-module-test.scm</span>
<span style="color: #98be65;">cp</span><span style="color: #98be65;"> gambit-hello-world*.js ../public/</span>
<span style="color: #98be65;">EOF</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">import</span> <span style="color: #c678dd;">:gerbil/gambit</span>)
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Hello = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
)

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">document.getElementById</span> id)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2foreign(document.getElementById(g_scm2host(@1@)))"</span> id))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">Element.innerText-ref</span> elem)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2scm(g_foreign2host(@1@).innerText)"</span> elem))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sourceCodeRun</span> id)
  (<span style="color: #51afef;">let*</span> ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (<span style="color: #51afef;">let</span> ((expr (cons <span style="color: #51afef;">'</span><span style="color: #c678dd;">##</span>begin (with-input-from-string code read-all))))
      (<span style="color: #51afef;">eval</span> expr))

    ))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">init-gambit-module</span> mod)
  (<span style="color: #51afef;">let</span> ((init (<span style="color: #c678dd;">##</span>vector-ref mod 4)))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (<span style="color: #c678dd;">##</span>procedure? init)) (<span style="color: #51afef;">error</span> <span style="color: #98be65;">"No init for "</span> mod)
      (init))))

(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"</span>
<span style="color: #98be65;">gx_old_module_register = g_module_register;</span>

<span style="color: #98be65;">gx_gambit_module_table = [];</span>

<span style="color: #98be65;">gx_gambit_module_init = function (m) { alert('gx_gambit_module_init undefined') }</span>

<span style="color: #98be65;">gx_gambit_module_register = function (module_descr) {</span>
<span style="color: #98be65;">  gx_gambit_module_table.push(module_descr);</span>
<span style="color: #98be65;">  typeof g_glo['##program-descr'] === 'object' ? gx_gambit_module_init(module_descr)</span>
<span style="color: #98be65;">    : gx_old_module_register(module_descr)</span>
<span style="color: #98be65;">}</span>

<span style="color: #98be65;">g_module_register = gx_gambit_module_register;</span>

<span style="color: #98be65;">console.log(g_module_register);</span>

<span style="color: #98be65;">"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"gx_gambit_module_init = (g_scm2host(@1@))"</span> (<span style="color: #51afef;">lambda</span> (mod) (init-gambit-module mod)))


(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"g_sourceCodeRun = function () { alert('sourceCodeRun'); };"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"g_sourceCodeRun = g_scm2host(@1@);"</span> sourceCodeRun)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">declare</span> (extended-bindings))
(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Test = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Test' + arg)</span>
<span style="color: #98be65;">}"</span>
)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
  &lt;<span style="color: #c678dd;">q-page</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Hello('WOrld! Tahgle!')"</span>&gt; Hello World&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Test('WOrld! Tahgle!')"</span>&gt; Test function&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
    &lt;<span style="color: #c678dd;">br</span>&gt;
    &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"full-width"</span> <span style="color: #dcaeea;">contenteditable</span>=<span style="color: #98be65;">"true"</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"gx_repl"</span> <span style="color: #dcaeea;">style</span>=<span style="color: #98be65;">"max-width: 300px; height: 25vh; border: 2px solid black;"</span>&gt;
    534
   &lt;/<span style="color: #c678dd;">div</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"sourceCodeRun('gx_repl')"</span>&gt; Repl &lt;/<span style="color: #c678dd;">q-btn</span>&gt;
  &lt;/<span style="color: #c678dd;">q-page</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;

import { Hello } from 'app/public/gambit-hello-world.js'

import { Test } from 'app/public/gambit-hello-world-module-test.js'

window.Hello = Hello
window.Test = Test

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    },
    sourceCodeRun (id) {
      var val = g_sourceCodeRun(id)
      alert('=&gt;' + val)
    }
  }
}
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-org96e6c04" class="outline-2">
<h2 id="org96e6c04"><span class="section-number-2">5</span> Lazy-load <code>_gambit.js</code>.</h2>
<div class="outline-text-2" id="text-5">
<p>
That works as well. So, now, an attempt to make the Gambit <code>_gambit</code> module
become a dynamically loaded <code>js</code> module.
</p>


<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">import</span> <span style="color: #c678dd;">:gerbil/gambit</span>)
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.evalElement = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Lazy? Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
)

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">document.getElementById</span> id)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2foreign(document.getElementById(g_scm2host(@1@)))"</span> id))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">Element.innerText-ref</span> elem)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2scm(g_foreign2host(@1@).innerText)"</span> elem))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">sourceCodeRun</span> id)
  (<span style="color: #51afef;">let*</span> ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (<span style="color: #51afef;">let</span> ((expr (cons <span style="color: #51afef;">'</span><span style="color: #c678dd;">##</span>begin (with-input-from-string code read-all))))
      (<span style="color: #51afef;">eval</span> expr))

    ))

(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"g_sourceCodeRun = function () { alert('sourceCodeRun'); };"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"g_sourceCodeRun = g_scm2host(@1@);"</span> sourceCodeRun)

</pre>
</div>
</div>
