doc/log/0000_Getting-Started.org
** First attempt

We'll simply try to insert it at the end of our custom run-time. It does not
actually work but gives us great insights as to why.

#+begin_src shell
bash <<'EOF'
 gxc -v -d . -S -static hello-gxjs-rt.ss
 gxc -v -d . -S -static hello.ss
 gxc -v -d . -S -static gambit-module-test.ss
 gxc -v -d . -S -static lazy-gambit-repl.ss

 gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm
 gsc -target js -o hello-gxjs.js -exe -l hello-gxjs-rt static/hello.scm

 # Now output the modules test as a standalone
 gsc -target js -o gambit-module-test.js static/gambit-module-test.scm

 # Ok, now the lazy gambit repl
 gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm

 # and copy to public, including the _gambit.js

 _gambit_js=$(gsc -e '(display (path-expand "~~lib/"))')/_gambit.js;
 _cp="cp hello-gxjs.js lazy-gambit-repl.js gambit-module-test.js $_gambit_js ../public";
 echo Copy $_cp; $_cp

EOF
#+end_src

It fails in the browser with
   : ReferenceError: G_Bignum is not defined

Is that because our runtime lib does not require that but _gambit.js does? We'll
use the ~-verbose~ and ~-keep-temp~ flags to find out.

#+begin_src shell
bash <<'EOF'

 gxc -v -d . -S -static hello-gxjs-rt.ss
 gxc -v -d . -S -static hello.ss
 gxc -v -d . -S -static gambit-module-test.ss
 gxc -v -d . -S -static lazy-gambit-repl.ss
 gxc -v -d . -S -static gambit-hello-world-module-test.ss
 gxc -v -d . -S -static gambit-hello-world.ss

 gsc -target js -o gambit-hello-world-module-test.js static/gambit-hello-world-module-test.scm

 # Now output the modules test as a standalone
 gsc -target js -o gambit-module-test.js static/gambit-module-test.scm

 # Ok, now the lazy gambit repl
 gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm

 gsc -verbose -keep-temp -target js -exe -o gambit-hello-world.js static/gambit-hello-world.scm

 gsc -verbose -keep-temp -target js -o hello-gxjs.js -exe -l hello-gxjs-rt static/hello.scm
EOF
#+end_src

That ends up giving us some interesting details.

   : cat static/gambit-hello-world_.o static/gambit-hello-world.o "/nix/store/48ksq09y70dz19dyf8i411js6li9i968-gambit-unstable-2020-10-27/gambit/lib/_gambit.js" > "gambit-hello-world.js"
   : cat static/hello_.o static/hello.o "hello-gxjs-rt.js" > "hello-gxjs.js"

   The ~*_.o~ files are generated by the complier. Here are the options.

   #+begin_quote
   Output mode
    -target l   Select target language to compile to (C, js, x86-64, ...)
    -c          Compile to target language source files (.c, .js, ...)
    -link       Generate a link file combining a set of compiled files
    -obj        Compile to object files (.o, .obj)
    -exe        Compile to an executable program or script
    -dynamic    Compile to a .oN dynamically loadable file (default mode)
   #+end_quote

   Interesting! What happens with ~-link~?

   #+begin_src shell
gsc -verbose -keep-temp -target js -link -o gambit-hello-world-link.js static/gambit-hello-world.scm

# This does not have any files to "-keep-temp"! That's a good thing.

wc gambit-hello-world-link.js static/gambit-hello-world_.js
     1518      8271    112123 gambit-hello-world-link.js
     1518      8271    112119 static/gambit-hello-world_.js
     3036     16542    224242 total

   #+end_src

That's brilliant. 4 char difference? Hmmmm.

#+begin_src shell
 bash <<'EOF'
_lnk='gambit-hello-world-link'
_under='gambit-hello-world_'

echo char diff? => $(expr `echo $_lnk | wc -c` - `echo $_under |wc -c`)
>
EOF

  # char diff? => 4

#+end_src

Beyond the file name they are identical as a ~diff~ shows us.

The differences between those and our ~hello_.js~ generated link file are
immense.

#+begin_src shell
du -k gambit-hello-world-link.js static/hello_.js
# 112     gambit-hello-world-link.js
# 12      static/hello_.js

#+end_src

An extra 100k is a hellovalot. Can that one work with our existing hello?

A quick ~diff gambit-hello-world-link.js static/hello_.js~ has almost all ~-~
lines besides the second line which is a comment that Gambit generates/uses and
the last line.

The last line is likely the crucial one. With a wee bit of know-how about how
gambit modules run/interact etc it makes perfect sense.

#+begin_src diff
-g_module_registry_init([new G_ModLinkInfo("_gambit",0),new G_ModLinkInfo("gambit-hello-world",1)]);
+g_module_registry_init([new G_ModLinkInfo("hello-gxjs-rt",0),new G_ModLinkInfo("hello",1)]);
#+end_src

A different module registry seems to define when/how/if a "module" is
initialized by the run time.

Here is the ~js~.

#+begin_src javascript
g_module_registry_init = function (link_info) {
  var n = link_info.length;
  var i = 0;
  g_module_table = new Array(n);
  while (i < n) {
    var info = link_info[i];
    g_module_map[info.name] = info;
    g_module_table[i] = null;
    ++i;
  }
};
#+end_src

Now every gambit module registers itself at the EOF.

#+begin_src shell
grep '^g_module_register' static/hello.js
g_module_register([[g_make_interned_symbol("hello")],[],null,1,g_bb1_hello_23_,false]);
#+end_src

The source for that is brilliant as it tells me what I need to know and why we
had to init the way we did. The comments are all mine.

#+begin_src javascript
g_module_register = function (module_descr) {

  // The interned symbol of the name in an array

  var temp = module_descr[0];

  // the name of the module.
  var name = temp[temp.length - 1].name;

  // Search for it in the module registry by name.
  var info = Object.prototype.hasOwnProperty.call(g_module_map,name) ? g_module_map[name] : null;

  // Set the latest registered to this module
  g_module_latest_registered = module_descr;

  // If we are not waiting for this module OR we already have all we are waiting
  // for, ignore it.

  if (!(info === null || g_module_count === g_module_table.length)) {

    // on initialization we gave this an index and a name.
    var index = info.index;
    // If this is already registered, let us know.
    var old = g_module_table[index];

    // regardless, this new module is in the table.

    g_module_table[index] = module_descr;

    // If there was no old, increase the count and continue.
    if (old === null) {
      ++g_module_count;
      // If we have all the modules, let the program
      if (g_module_count === g_module_table.length) {
        // set the global ##program-descr to an array of the module table and
        // two other things I do not understand.
        g_glo["##program-descr"] = [g_module_table,null,false];

        // This is the array of a symbol that names the last module in the
        // init.
        temp = g_module_table[g_module_table.length - 1][0];
        g_glo["##vm-main-module-ref"] = temp[temp.length - 1];

        // I think this is the prefix to running a function via the trampoline
        g_sp = -1;
        g_stack[++g_sp] = void 0;
        g_r0 = g_underflow;
        g_nargs = 0;

        // This runs the init procedure of the first registry_init we specified.

        g_trampoline(g_module_table[0][4]);
      }
    }
  }
};

#+end_src

That helps a lot! We already test and initialize them on their own when the
registry is full. Knowing the order they are initialized we can simply replace
the init function.



#+begin_src shell
gxc -v -d . -S -static link-gxjs-rt.ss
gxc -v -d . -S -static hello-world.ss
gsc -target js -c -o link-gxjs-rt.js static/link-gxjs-rt.scm
gsc -target js -l link-gxjs-rt -link -o link-hello-world.js static/hello-world.scm
#+end_src

