log/0000_Getting-Started.html

<div id="outline-container-org1eaa773" class="outline-3">
<h3 id="org1eaa773"><span class="section-number-3">5.1</span> First attempt</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We&rsquo;ll simply try to insert it at the end of our custom run-time. It does not
actually work but gives us great insights as to why.
</p>

<div class="org-src-container">
<pre class="src src-shell">bash &lt;&lt;<span style="color: #98be65;">'EOF'</span>
<span style="color: #98be65;"> gxc -v -d . -S -static hello-gxjs-rt.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static hello.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static gambit-module-test.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static lazy-gambit-repl.ss</span>

<span style="color: #98be65;"> gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm</span>
<span style="color: #98be65;"> gsc -target js -o hello-gxjs.js -exe -l hello-gxjs-rt static/hello.scm</span>

<span style="color: #98be65;"> # Now output the modules test as a standalone</span>
<span style="color: #98be65;"> gsc -target js -o gambit-module-test.js static/gambit-module-test.scm</span>

<span style="color: #98be65;"> # Ok, now the lazy gambit repl</span>
<span style="color: #98be65;"> gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm</span>

<span style="color: #98be65;"> # and copy to public, including the _gambit.js</span>

<span style="color: #98be65;"> _gambit_js=$(</span><span style="color: #51afef; font-weight: bold;">gsc</span><span style="color: #98be65;"> -e '(display (path-expand "~~lib/"))')/_gambit.js;</span>
<span style="color: #98be65;"> _cp="</span><span style="color: #98be65;">cp</span><span style="color: #98be65;"> hello-gxjs.js lazy-gambit-repl.js gambit-module-test.js $_gambit_js ../public";</span>
<span style="color: #98be65;"> </span><span style="color: #98be65;">echo</span><span style="color: #98be65;"> Copy $_cp; $_cp</span>

<span style="color: #98be65;">EOF</span>
</pre>
</div>

<p>
It fails in the browser with
</p>
<pre class="example">
ReferenceError: G_Bignum is not defined
</pre>


<p>
Is that because our runtime lib does not require that but _gambit.js does? We&rsquo;ll
use the <code>-verbose</code> and <code>-keep-temp</code> flags to find out.
</p>

<div class="org-src-container">
<pre class="src src-shell">bash &lt;&lt;<span style="color: #98be65;">'EOF'</span>

<span style="color: #98be65;"> gxc -v -d . -S -static hello-gxjs-rt.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static hello.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static gambit-module-test.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static lazy-gambit-repl.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static gambit-hello-world-module-test.ss</span>
<span style="color: #98be65;"> gxc -v -d . -S -static gambit-hello-world.ss</span>

<span style="color: #98be65;"> gsc -target js -o gambit-hello-world-module-test.js static/gambit-hello-world-module-test.scm</span>

<span style="color: #98be65;"> # Now output the modules test as a standalone</span>
<span style="color: #98be65;"> gsc -target js -o gambit-module-test.js static/gambit-module-test.scm</span>

<span style="color: #98be65;"> # Ok, now the lazy gambit repl</span>
<span style="color: #98be65;"> gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm</span>

<span style="color: #98be65;"> gsc -verbose -keep-temp -target js -exe -o gambit-hello-world.js static/gambit-hello-world.scm</span>

<span style="color: #98be65;"> gsc -verbose -keep-temp -target js -o hello-gxjs.js -exe -l hello-gxjs-rt static/hello.scm</span>
<span style="color: #98be65;">EOF</span>
</pre>
</div>

<p>
That ends up giving us some interesting details.
</p>

<pre class="example">
cat static/gambit-hello-world_.o static/gambit-hello-world.o "/nix/store/48ksq09y70dz19dyf8i411js6li9i968-gambit-unstable-2020-10-27/gambit/lib/_gambit.js" &gt; "gambit-hello-world.js"
cat static/hello_.o static/hello.o "hello-gxjs-rt.js" &gt; "hello-gxjs.js"
</pre>


<p>
The <code>*_.o</code> files are generated by the complier. Here are the options.
</p>

<blockquote>
<p>
Output mode
 -target l   Select target language to compile to (C, js, x86-64, &#x2026;)
 -c          Compile to target language source files (.c, .js, &#x2026;)
 -link       Generate a link file combining a set of compiled files
 -obj        Compile to object files (.o, .obj)
 -exe        Compile to an executable program or script
 -dynamic    Compile to a .oN dynamically loadable file (default mode)
</p>
</blockquote>

<p>
Interesting! What happens with <code>-link</code>?
</p>

<div class="org-src-container">
<pre class="src src-shell">gsc -verbose -keep-temp -target js -link -o gambit-hello-world-link.js static/gambit-hello-world.scm

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">This does not have any files to "-keep-temp"! That's a good thing.</span>

wc gambit-hello-world-link.js static/gambit-hello-world_.js
     <span style="color: #da8548; font-weight: bold;">1518</span>      <span style="color: #da8548; font-weight: bold;">8271</span>    <span style="color: #da8548; font-weight: bold;">112123</span> gambit-hello-world-link.js
     <span style="color: #da8548; font-weight: bold;">1518</span>      <span style="color: #da8548; font-weight: bold;">8271</span>    <span style="color: #da8548; font-weight: bold;">112119</span> static/gambit-hello-world_.js
     <span style="color: #da8548; font-weight: bold;">3036</span>     <span style="color: #da8548; font-weight: bold;">16542</span>    <span style="color: #da8548; font-weight: bold;">224242</span> total

</pre>
</div>

<p>
That&rsquo;s brilliant. 4 char difference? Hmmmm.
</p>

<div class="org-src-container">
<pre class="src src-shell"> bash &lt;&lt;<span style="color: #98be65;">'EOF'</span>
<span style="color: #98be65;">_lnk='gambit-hello-world-link'</span>
<span style="color: #98be65;">_under='gambit-hello-world_'</span>

<span style="color: #98be65;">echo</span><span style="color: #98be65;"> char diff? =&gt; $(</span><span style="color: #51afef; font-weight: bold;">expr</span><span style="color: #98be65;"> `</span><span style="color: #98be65;">echo</span><span style="color: #98be65;"> $_lnk | wc -c` - `</span><span style="color: #98be65;">echo</span><span style="color: #98be65;"> $_under |wc -c`)</span>
<span style="color: #98be65;">&gt;</span>
<span style="color: #98be65;">EOF</span>

  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">char diff? =&gt; 4</span>

</pre>
</div>

<p>
Beyond the file name they are identical as a <code>diff</code> shows us.
</p>

<p>
The differences between those and our <code>hello_.js</code> generated link file are
immense.
</p>

<div class="org-src-container">
<pre class="src src-shell">du -k gambit-hello-world-link.js static/hello_.js
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">112     gambit-hello-world-link.js</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">12      static/hello_.js</span>

</pre>
</div>

<p>
An extra 100k is a hellovalot. Can that one work with our existing hello?
</p>

<p>
A quick <code>diff gambit-hello-world-link.js static/hello_.js</code> has almost all <code>-</code>
lines besides the second line which is a comment that Gambit generates/uses and
the last line.
</p>

<p>
The last line is likely the crucial one. With a wee bit of know-how about how
gambit modules run/interact etc it makes perfect sense.
</p>

<div class="org-src-container">
<pre class="src src-diff"><span style="color: #aa2222; background-color: #23272e;">-</span><span style="color: #ff6c6b; background-color: #23272e;">g_module_registry_init([new G_ModLinkInfo("_gambit",0),new G_ModLinkInfo("gambit-hello-world",1)]);</span>
+g_module_registry_init([new G_ModLinkInfo("hello-gxjs-rt",0),new G_ModLinkInfo("hello",1)]);
</pre>
</div>

<p>
A different module registry seems to define when/how/if a &ldquo;module&rdquo; is
initialized by the run time.
</p>

<p>
Here is the <code>js</code>.
</p>

<div class="org-src-container">
<pre class="src src-javascript">g_module_registry_init = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">link_info</span>) {
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">n</span> = link_info.length;
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>;
  g_module_table = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Array</span>(n);
  <span style="color: #51afef;">while</span> (i &lt; n) {
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">info</span> = link_info[i];
    g_module_map[info.name] = info;
    g_module_table[i] = <span style="color: #a9a1e1;">null</span>;
    ++i;
  }
};
</pre>
</div>

<p>
Now every gambit module registers itself at the EOF.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">grep</span> <span style="color: #98be65;">'^g_module_register'</span> static/hello.js
<span style="color: #c678dd;">g_module_register</span><span style="color: #51afef;">(</span><span style="color: #c678dd;">[</span><span style="color: #98be65;">[</span>g_make_interned_symbol<span style="color: #51afef;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #51afef;">)</span><span style="color: #98be65;">]</span>,<span style="color: #98be65;">[]</span>,null,1,g_bb1_hello_23_,false<span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>;
</pre>
</div>

<p>
The source for that is brilliant as it tells me what I need to know and why we
had to init the way we did. The comments are all mine.
</p>

<div class="org-src-container">
<pre class="src src-javascript">g_module_register = <span style="color: #51afef;">function</span> (<span style="color: #dcaeea;">module_descr</span>) {

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The interned symbol of the name in an array</span>

  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">temp</span> = module_descr[<span style="color: #da8548; font-weight: bold;">0</span>];

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">the name of the module.</span>
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">name</span> = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>].name;

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Search for it in the module registry by name.</span>
  <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">info</span> = Object.<span style="color: #a9a1e1;">prototype</span>.hasOwnProperty.call(g_module_map,name) ? g_module_map[name] : <span style="color: #a9a1e1;">null</span>;

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Set the latest registered to this module</span>
  g_module_latest_registered = module_descr;

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">If we are not waiting for this module OR we already have all we are waiting</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">for, ignore it.</span>

  <span style="color: #51afef;">if</span> (!(info === <span style="color: #a9a1e1;">null</span> || g_module_count === g_module_table.length)) {

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">on initialization we gave this an index and a name.</span>
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">index</span> = info.index;
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">If this is already registered, let us know.</span>
    <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">old</span> = g_module_table[index];

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">regardless, this new module is in the table.</span>

    g_module_table[index] = module_descr;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">If there was no old, increase the count and continue.</span>
    <span style="color: #51afef;">if</span> (old === <span style="color: #a9a1e1;">null</span>) {
      ++g_module_count;
      <span style="color: #5B6268;">// </span><span style="color: #5B6268;">If we have all the modules, let the program</span>
      <span style="color: #51afef;">if</span> (g_module_count === g_module_table.length) {
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">set the global ##program-descr to an array of the module table and</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">two other things I do not understand.</span>
        g_glo[<span style="color: #98be65;">"##program-descr"</span>] = [g_module_table,<span style="color: #a9a1e1;">null</span>,<span style="color: #a9a1e1;">false</span>];

        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">This is the array of a symbol that names the last module in the</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">init.</span>
        temp = g_module_table[g_module_table.length - <span style="color: #da8548; font-weight: bold;">1</span>][<span style="color: #da8548; font-weight: bold;">0</span>];
        g_glo[<span style="color: #98be65;">"##vm-main-module-ref"</span>] = temp[temp.length - <span style="color: #da8548; font-weight: bold;">1</span>];

        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">I think this is the prefix to running a function via the trampoline</span>
        g_sp = -<span style="color: #da8548; font-weight: bold;">1</span>;
        g_stack[++g_sp] = <span style="color: #51afef;">void</span> <span style="color: #da8548; font-weight: bold;">0</span>;
        g_r0 = g_underflow;
        g_nargs = <span style="color: #da8548; font-weight: bold;">0</span>;

        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">This runs the init procedure of the first registry_init we specified.</span>

        g_trampoline(g_module_table[<span style="color: #da8548; font-weight: bold;">0</span>][<span style="color: #da8548; font-weight: bold;">4</span>]);
      }
    }
  }
};

</pre>
</div>

<p>
That helps a lot! We already test and initialize them on their own when the
registry is full. Knowing the order they are initialized we can simply replace
the init function.
</p>



<div class="org-src-container">
<pre class="src src-shell">gxc -v -d . -S -static link-gxjs-rt.ss
gxc -v -d . -S -static hello-world.ss
gsc -target js -c -o link-gxjs-rt.js static/link-gxjs-rt.scm
gsc -target js -l link-gxjs-rt -link -o link-hello-world.js static/hello-world.scm
</pre>
</div>
</div>
</div>
