doc/log/0000_Getting-Started.org
** Second Attempt: Make/change link files.

First, our normal hello-gxjs

#+begin_src shell
 gxc -v -d . -S -static hello-gxjs-rt.ss
 gxc -v -d . -S -static hello.ss
 gxc -v -d . -S -static gambit-module-test.ss
 gxc -v -d . -S -static lazy-gambit-repl.ss
#+end_src

Now make a ~-link~ rather than an ~-exe~. We'll follow the gambit "end with _".
#+begin_src shell
gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm
gsc -target js -o REMOVE-hello-gxjs_.js -link -l hello-gxjs-rt static/hello.scm
_mod_init="$(grep -rE '^g_module_registry_init\(' REMOVE-hello-gxjs_.js)"

echo $_mod_init
#+end_src


Time to create a ~-link~ that includes all that ~_gambit.js~ seems to need. We replace the module_registry_init line.

#+begin_src shell
gsc -target js -o hello_.js -link static/hello.scm
sed -i "s/^g_module_registry_init(.*/$_mod_init/" hello_.js
#+end_src

And compile the other modules.

#+begin_src shell
 gsc -target js -o hello.js static/hello.scm
 gsc -target js -o gambit-module-test.js static/gambit-module-test.scm
 gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm
#+end_src

Now the fun part. Earlier we saw that compilation can simply ~cat~ ~js~ files together.


   : cat static/gambit-hello-world_.o static/gambit-hello-world.o "/nix/store/48ksq09y70dz19dyf8i411js6li9i968-gambit-unstable-2020-10-27/gambit/lib/_gambit.js" > "gambit-hello-world.js"
   : cat static/hello_.o static/hello.o "hello-gxjs-rt.js" > "hello-gxjs.js"

Doing the same, what happens?

#+begin_src shell
cat hello_.js hello.js hello-gxjs-rt.js > hello-gxjs.js
#+end_src

For the lazy we'll do ~_gambit.js~ first as the loading and initialization is taken care of by us.

#+begin_src shell
cat $(gsc -e '(display (path-expand "~~lib/_gambit.js"))') lazy-gambit-repl.js > gambit-repl.js
#+end_src

It doesn't work.

   : g_glo.##current-readtable is not a function

That seems to be that although that is in ~_gambit.js~ it's not loaded. Reversing the order as an exe does also fails.

Hrm.

