log/0000_Getting-Started.html

<div id="outline-container-org19d9fe3" class="outline-3">
<h3 id="org19d9fe3"><span class="section-number-3">5.2</span> Second Attempt: Make/change link files.</h3>
<div class="outline-text-3" id="text-5-2">
<p>
First, our normal hello-gxjs
</p>

<div class="org-src-container">
<pre class="src src-shell"> gxc -v -d . -S -static hello-gxjs-rt.ss
 gxc -v -d . -S -static hello.ss
 gxc -v -d . -S -static gambit-module-test.ss
 gxc -v -d . -S -static lazy-gambit-repl.ss
</pre>
</div>

<p>
Now make a <code>-link</code> rather than an <code>-exe</code>. We&rsquo;ll follow the gambit &ldquo;end with _&rdquo;.
</p>
<div class="org-src-container">
<pre class="src src-shell">gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm
gsc -target js -o REMOVE-hello-gxjs_.js -link -l hello-gxjs-rt static/hello.scm
<span style="color: #dcaeea;">_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' REMOVE-hello-gxjs_.js)</span><span style="color: #98be65;">"</span>

<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_mod_init</span>
</pre>
</div>


<p>
Time to create a <code>-link</code> that includes all that <code>_gambit.js</code> seems to need. We replace the module<sub>registry</sub><sub>init</sub> line.
</p>

<div class="org-src-container">
<pre class="src src-shell">gsc -target js -o hello_.js -link static/hello.scm
sed -i <span style="color: #98be65;">"s/^g_module_registry_init(.*/$_mod_init/"</span> hello_.js
</pre>
</div>

<p>
And compile the other modules.
</p>

<div class="org-src-container">
<pre class="src src-shell"> gsc -target js -o hello.js static/hello.scm
 gsc -target js -o gambit-module-test.js static/gambit-module-test.scm
 gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm
</pre>
</div>

<p>
Now the fun part. Earlier we saw that compilation can simply <code>cat</code> <code>js</code> files together.
</p>


<pre class="example">
cat static/gambit-hello-world_.o static/gambit-hello-world.o "/nix/store/48ksq09y70dz19dyf8i411js6li9i968-gambit-unstable-2020-10-27/gambit/lib/_gambit.js" &gt; "gambit-hello-world.js"
cat static/hello_.o static/hello.o "hello-gxjs-rt.js" &gt; "hello-gxjs.js"
</pre>


<p>
Doing the same, what happens?
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">cat</span> hello_.js hello.js hello-gxjs-rt.js &gt; hello-gxjs.js
</pre>
</div>

<p>
For the lazy we&rsquo;ll do <code>_gambit.js</code> first as the loading and initialization is taken care of by us.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">cat</span> $<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">gsc</span> -e <span style="color: #98be65;">'(display (path-expand "~~lib/_gambit.js"))'</span><span style="color: #51afef;">)</span> lazy-gambit-repl.js &gt; gambit-repl.js
</pre>
</div>

<p>
It doesn&rsquo;t work.
</p>

<pre class="example">
g_glo.##current-readtable is not a function
</pre>


<p>
That seems to be that although that is in <code>_gambit.js</code> it&rsquo;s not loaded. Reversing the order as an exe does also fails.
</p>

<p>
Hrm.
</p>
</div>
</div>
