doc/log/0000_Getting-Started.org
** Third Attempt: re-init registry


Compilation of an exe that contains all we want is a good start. Rather than our
runtime we'll simply emulate the only thing ~hello.ss~ uses in a ~gxsj-alert.ss~ file.


#+begin_src scheme :tangle ~/me/ecm/src/gx-quasar/gx/gxjs-alert.ss
namespace: gxjs
(declare (extended-bindings))

(def (alert thing) (##inline-host-statement "var foo = (@1@);
  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)
  alert(bar);" thing))
(def (console.log obj) (##inline-host-statement "console.log((@1@))" obj))
#+end_src

Ok, same as last time, ~gxc~ everything.

#+begin_src shell
 gxc -v -d . -S -static hello-gxjs-rt.ss
 gxc -v -d . -S -static gxjs-alert.ss
 gxc -v -d . -S -static hello.ss
 gxc -v -d . -S -static gambit-hello-world-module-test.ss
 gxc -v -d . -S -static lazy-gambit-repl.ss
#+end_src


#+begin_src shell
gsc -verbose -keep-temp -target js -exe -o gambit-nonlazy-hello.js static/gxjs-alert.scm static/hello.scm static/gambit-hello-world-module-test.scm static/lazy-gambit-repl.scm
cp gambit-nonlazy-hello.js ../public/
#+end_src

   : => cat static/lazy-gambit-repl_.o static/gxjs-alert.o static/hello.o static/gambit-hello-world-module-test.o static/lazy-gambit-repl.o "/nix/store/48ksq09y70dz19dyf8i411js6li9i968-gambit-unstable-2020-10-27/gambit/lib/_gambit.js" "gambit-nonlazy-hello.js"


And try in in ~Index.vue~.

  : import { Hello, Test } from 'app/public/gambit-nonlazy-hello.js'
  : // This also imports all of _gambit.js

A quick look says the link file is identical save for the registry init. That's a good thing. Oh, and it works.

#+begin_src shell
_nonlazy_link='static/lazy-gambit-repl_.o'
_nonlazy_mod_init="$(grep -rE '^g_module_registry_init\(' $_nonlazy_link)"
#+end_src

So like last time we'll build one that was the init we want

#+begin_src shell
gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm
gsc -target js -o REMOVE-hello-gxjs_.js -link -l hello-gxjs-rt static/hello.scm

_hello_mod_init="$(grep -rE '^g_module_registry_init\(' REMOVE-hello-gxjs_.js)"

echo $_hello_mod_init
#+end_src

#+begin_src shell
gsc -target js -o hello_.js -link static/hello.scm
sed -i "s/^g_module_registry_init(.*/$_hello_mod_init/" hello_.js
gsc -target js -o hello.js static/hello.scm
cat hello_.js hello.js hello-gxjs-rt.js > hello-gxjs.js
cp hello-gxjs.js ../public
#+end_src

The entire reason behind this is after loading and initializing the module
registry it to reset the module registry and init it again.

So, to reset it we'll try this:
#+begin_src shell
_mod_reset="$(grep '^g_module_.* = [^f]' hello_.js)"


echo  "$_mod_reset" > g-module-reset.js

# g_module_count = 0;
# g_module_map = {};
# g_module_table = null;
# g_module_latest_registered = null;

#+end_src

#+begin_src javascript :tangle ../../gx/g-module-reset.js
g_module_count = 0;
g_module_map = {};
g_module_table = null;
g_module_latest_registered = null;
#+end_src

Now for a re-init. First, what does the link want?

#+begin_src shell
gsc -target js -link -o gambit-repl_.js static/lazy-gambit-repl.scm
_lazy_mod_init="$(grep -rE '^g_module_registry_init\(' gambit-repl_.js)"
echo $_lazy_mod_init > lazy-mod-init.js
echo "delete g_glo['##program-descr']" >> lazy-mod-init.js
#+end_src

Compile the other modules


#+begin_src shell
 gsc -target js -o gambit-module-test.js static/gambit-module-test.scm
 gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm
#+end_src
#+begin_src shell
cat g-module-reset.js lazy-mod-init.js lazy-gambit-repl.js $(gsc -e '(display (path-expand "~~lib/_gambit.js"))')  > gambit-repl.js
cp gambit-repl.js gambit-module-test.js ../public
#+end_src

It works!!

We can now lazy-load anything it seems.

** A new ~Index.vue~

This is what we end up with.

#+begin_src vue :tangle ../../src/pages/Index.vue
<template>
  <q-page class="flex flex-center">
    <q-btn color="red" @click="Hello('WOrld! Tahgle!')"> Hello World</q-btn>
    <q-btn color="red" @click="Test('WOrld! Tahgle!')"> Test function</q-btn>
    <br>
    <div class="full-width" contenteditable="true" id="gx_repl" style="max-width: 300px; height: 25vh; border: 2px solid black;">
    534
   </div>
    <q-btn color="red" @click="sourceCodeRun('gx_repl')"> Repl </q-btn>
  </q-page>
</template>

<script>

// import { Hello, Test } from 'app/public/gambit-nonlazy-hello.js'

import { Hello } from 'app/public/hello-gxjs.js'
import { Test } from 'app/public/gambit-module-test.js'

// var Test = Hello

import 'app/public/gambit-repl.js'

window.Hello = Hello
window.Test = Test

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    },
    sourceCodeRun (id) {
      var val = g_sourceCodeRun(id)
      alert('=> ' + val)
    }
  }
}
</script>
#+end_src
