log/0000_Getting-Started.html

<div id="outline-container-thirdreinit" class="outline-3">
<h3 id="thirdreinit"><span class="section-number-3">5.3</span> Third Attempt: re-init registry</h3>
<div class="outline-text-3" id="text-thirdreinit">
<p>
Compilation of an exe that contains all we want is a good start. Rather than our
runtime we&rsquo;ll simply emulate the only thing <code>hello.ss</code> uses in a <code>gxsj-alert.ss</code> file.
</p>


<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> gxjs
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">alert</span> thing) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"var foo = (@1@);</span>
<span style="color: #98be65;">  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)</span>
<span style="color: #98be65;">  alert(bar);"</span> thing))
(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">console.log</span> obj) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"console.log((@1@))"</span> obj))
</pre>
</div>

<p>
Ok, same as last time, <code>gxc</code> everything.
</p>

<div class="org-src-container">
<pre class="src src-shell"> gxc -v -d . -S -static hello-gxjs-rt.ss
 gxc -v -d . -S -static gxjs-alert.ss
 gxc -v -d . -S -static hello.ss
 gxc -v -d . -S -static gambit-hello-world-module-test.ss
 gxc -v -d . -S -static lazy-gambit-repl.ss
</pre>
</div>


<div class="org-src-container">
<pre class="src src-shell">gsc -verbose -keep-temp -target js -exe -o gambit-nonlazy-hello.js static/gxjs-alert.scm static/hello.scm static/gambit-hello-world-module-test.scm static/lazy-gambit-repl.scm
<span style="color: #ECBE7B;">cp</span> gambit-nonlazy-hello.js ../public/
</pre>
</div>

<pre class="example">
=&gt; cat static/lazy-gambit-repl_.o static/gxjs-alert.o static/hello.o static/gambit-hello-world-module-test.o static/lazy-gambit-repl.o "/nix/store/48ksq09y70dz19dyf8i411js6li9i968-gambit-unstable-2020-10-27/gambit/lib/_gambit.js" "gambit-nonlazy-hello.js"
</pre>



<p>
And try in in <code>Index.vue</code>.
</p>

<pre class="example">
import { Hello, Test } from 'app/public/gambit-nonlazy-hello.js'
// This also imports all of _gambit.js
</pre>


<p>
A quick look says the link file is identical save for the registry init. That&rsquo;s a good thing. Oh, and it works.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">_nonlazy_link</span>=<span style="color: #98be65;">'static/lazy-gambit-repl_.o'</span>
<span style="color: #dcaeea;">_nonlazy_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' $_nonlazy_link)</span><span style="color: #98be65;">"</span>
</pre>
</div>

<p>
So like last time we&rsquo;ll build one that was the init we want
</p>

<div class="org-src-container">
<pre class="src src-shell">gsc -target js -c -o hello-gxjs-rt.js static/hello-gxjs-rt.scm
gsc -target js -o REMOVE-hello-gxjs_.js -link -l hello-gxjs-rt static/hello.scm

<span style="color: #dcaeea;">_hello_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' REMOVE-hello-gxjs_.js)</span><span style="color: #98be65;">"</span>

<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_hello_mod_init</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">gsc -target js -o hello_.js -link static/hello.scm
sed -i <span style="color: #98be65;">"s/^g_module_registry_init(.*/$_hello_mod_init/"</span> hello_.js
gsc -target js -o hello.js static/hello.scm
<span style="color: #ECBE7B;">cat</span> hello_.js hello.js hello-gxjs-rt.js &gt; hello-gxjs.js
<span style="color: #ECBE7B;">cp</span> hello-gxjs.js ../public
</pre>
</div>

<p>
The entire reason behind this is after loading and initializing the module
registry it to reset the module registry and init it again.
</p>

<p>
So, to reset it we&rsquo;ll try this:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">_mod_reset</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> '^g_module_.* = [^f]' hello_.js)</span><span style="color: #98be65;">"</span>


<span style="color: #ECBE7B;">echo</span>  <span style="color: #98be65;">"$_mod_reset"</span> &gt; g-module-reset.js

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">g_module_count = 0;</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">g_module_map = {};</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">g_module_table = null;</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">g_module_latest_registered = null;</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript">g_module_count = <span style="color: #da8548; font-weight: bold;">0</span>;
g_module_map = {};
g_module_table = <span style="color: #a9a1e1;">null</span>;
g_module_latest_registered = <span style="color: #a9a1e1;">null</span>;
</pre>
</div>

<p>
Now for a re-init. First, what does the link want?
</p>

<div class="org-src-container">
<pre class="src src-shell">gsc -target js -link -o gambit-repl_.js static/lazy-gambit-repl.scm
<span style="color: #dcaeea;">_lazy_mod_init</span>=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">$(</span><span style="color: #51afef; font-weight: bold;">grep</span><span style="color: #51afef; font-weight: bold;"> -rE '^g_module_registry_init\(' gambit-repl_.js)</span><span style="color: #98be65;">"</span>
<span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">_lazy_mod_init</span> &gt; lazy-mod-init.js
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"delete g_glo['##program-descr']"</span> &gt;&gt; lazy-mod-init.js
</pre>
</div>

<p>
Compile the other modules
</p>


<div class="org-src-container">
<pre class="src src-shell"> gsc -target js -o gambit-module-test.js static/gambit-module-test.scm
 gsc -target js -o lazy-gambit-repl.js static/lazy-gambit-repl.scm
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">cat</span> g-module-reset.js lazy-mod-init.js lazy-gambit-repl.js $<span style="color: #51afef;">(</span><span style="color: #51afef; font-weight: bold;">gsc</span> -e <span style="color: #98be65;">'(display (path-expand "~~lib/_gambit.js"))'</span><span style="color: #51afef;">)</span>  &gt; gambit-repl.js
<span style="color: #ECBE7B;">cp</span> gambit-repl.js gambit-module-test.js ../public
</pre>
</div>

<p>
It works!!
</p>

<p>
We can now lazy-load anything it seems.
</p>
</div>
</div>

<div id="outline-container-org4e2c8e2" class="outline-3">
<h3 id="org4e2c8e2"><span class="section-number-3">5.4</span> A new <code>Index.vue</code></h3>
<div class="outline-text-3" id="text-5-4">
<p>
This is what we end up with.
</p>

<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
  &lt;<span style="color: #c678dd;">q-page</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"flex flex-center"</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Hello('WOrld! Tahgle!')"</span>&gt; Hello World&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Test('WOrld! Tahgle!')"</span>&gt; Test function&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
    &lt;<span style="color: #c678dd;">br</span>&gt;
    &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"full-width"</span> <span style="color: #dcaeea;">contenteditable</span>=<span style="color: #98be65;">"true"</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"gx_repl"</span> <span style="color: #dcaeea;">style</span>=<span style="color: #98be65;">"max-width: 300px; height: 25vh; border: 2px solid black;"</span>&gt;
    534
   &lt;/<span style="color: #c678dd;">div</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"sourceCodeRun('gx_repl')"</span>&gt; Repl &lt;/<span style="color: #c678dd;">q-btn</span>&gt;
  &lt;/<span style="color: #c678dd;">q-page</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;

// import { Hello, Test } from 'app/public/gambit-nonlazy-hello.js'

import { Hello } from 'app/public/hello-gxjs.js'
import { Test } from 'app/public/gambit-module-test.js'

// var Test = Hello

import 'app/public/gambit-repl.js'

window.Hello = Hello
window.Test = Test

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    },
    sourceCodeRun (id) {
      var val = g_sourceCodeRun(id)
      alert('=&gt; ' + val)
    }
  }
}
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>
</div>
</div>
</div>
