doc/log/0000_Getting-Started.org
* Build and deploy the app

First we build!

#+begin_src shell
LD=$CC quasar build
#+end_src

Now make sure that if/when I fsck things up there's a backup.

#+begin_src shell
cd ../; rsync -av gx-quasar/ gx-quasar-bak;  cd -
#+end_src

Now create a branch as an orphan.

#+begin_src shell
git checkout --orphan gh-pages
git rm -rf .
# rm 'LICENSE'
# rm 'doc/log/0000_Getting-Started.org'
rsync -av dist/spa/ .
git add css/ fonts/ js/ index.html
git commit -m "First attempt at gh-pages"
git push origin gh-pages
#+end_src

A quick look says it's working quite well!

That will end this logfile as we're up and running. Next up will be to make it
useful.

* Footnotes

[fn:4] http://gambitscheme.org/

[fn:3] https://nixos.org/

[fn:2] https://cons.io/

[fn:1] TODO: Find a link to the cvs of mozilla/netscape that has the CL program!
