log/0000_Getting-Started.html
<div id="outline-container-orgf1585f7" class="outline-2">
<h2 id="orgf1585f7"><span class="section-number-2">6</span> Build and deploy the app</h2>
<div class="outline-text-2" id="text-6">
<p>
First we build!
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">LD</span>=$<span style="color: #dcaeea;">CC</span> quasar build
</pre>
</div>

<p>
Now make sure that if/when I fsck things up there&rsquo;s a backup.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">cd</span> ../; rsync -av gx-quasar/ gx-quasar-bak;  <span style="color: #ECBE7B;">cd</span> -
</pre>
</div>

<p>
Now create a branch as an orphan.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">git</span> checkout --orphan gh-pages
<span style="color: #ECBE7B;">git</span> <span style="color: #ECBE7B;">rm</span> -rf .
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">rm</span><span style="color: #5B6268;"> 'LICENSE'</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">rm</span><span style="color: #5B6268;"> 'doc/log/0000_Getting-Started.org'</span>
rsync -av dist/spa/ .
<span style="color: #ECBE7B;">git</span> add css/ fonts/ js/ index.html
<span style="color: #ECBE7B;">git</span> commit -m <span style="color: #98be65;">"First attempt at gh-pages"</span>
<span style="color: #ECBE7B;">git</span> push origin gh-pages
</pre>
</div>

<p>
A quick look says it&rsquo;s working quite well!
</p>

<p>
That will end this logfile as we&rsquo;re up and running. Next up will be to make it
useful.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
TODO: Find a link to the cvs of mozilla/netscape that has the CL program!
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://cons.io/">https://cons.io/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://nixos.org/">https://nixos.org/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="http://gambitscheme.org/">http://gambitscheme.org/</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Drew Crampsie</p>
<p class="date">Created: 2020-11-25 Wed 11:51</p>
</div>
</body>
</html>
